Repository: Azure/sonic-openssh
Catalog: debian/po/*.po
Languages: cs, da, fr, nl

source: Generate new configuration file
fr: Faut-il créer un nouveau fichier de configuration ?

source: This version of OpenSSH has a considerably changed configuration file from the version shipped in Debian 'Potato', which you appear to be upgrading from. I can now generate you a new configuration file (/etc/ssh/sshd.config), which will work with the new server version, but will not contain any customisations you made with the old version.
fr: Cette version d'OpenSSH utilise un fichier de configuration qui a fortement changé depuis la version contenue dans la distribution Debian « Potato », depuis laquelle vous semblez faire une mise à jour. Un nouveau fichier de configuration (/etc/ssh/sshd.config) qui fonctionnera avec la nouvelle version du serveur peut être créé, mais ne contiendra aucun des réglages que vous aviez faits avec la version précédente.

source: Please note that this new configuration file will set the value of 'PermitRootLogin' to yes (meaning that anyone knowing the root password can ssh directly in as root). It is the opinion of the maintainer that this is the correct default (see README.Debian for more details), but you can always edit sshd_config and set it to no if you wish.
cs: V novém konfiguraèním souboru bude parametr PermitRootLogin nastaven na hodnotu 'yes'. To znamená, ¾e se kdokoliv se znalostí rootova hesla mù¾e pøihlásit rovnou jako root. Pokud se chcete vrátit ke starému chování, staèí v sshd_config nastavit tento parametr na hodnotu 'no'. Více v README.Debian.
da: Bemærk at den nye opsætningsfil vil sætte værdien af 'PermitRootLogin' til ja (som betyder at alle der kender roots adgangskode, kan tilgå maskinen via ssh direkte). Det er vedligeholderens mening, at det er den korrekte standard-værdi (se README.Debian for flere detaljer), men du kan altid redigere sshd_config og slå det fra, hvis du ønsker.
fr: Veuillez noter que ce nouveau fichier de configuration positionnera la valeur de « PermitRootLogin » à « yes » (ce qui signifie que quiconque connaissant le mot de passe du superutilisateur peut se connecter en tant que tel sur la machine). Le responsable du paquet pense que c'est là un comportement par défaut normal (lisez README.Debian pour plus d'informations), mais vous pouvez toujours modifier le fichier sshd_config et changer cela.
nl: Merk op dat dit nieuwe configuratiebestand de waarde van 'PermitRootLogin' op 'yes' zet (wat betekent dat iedereen die het root-wachtwoord kent via ssh rechstreeks als root kan aanmelden). Het is de mening van de pakketbeheerder dat dit de juiste defaultwaarde is (zie README.Debian.gz voor meer details). Indien u dit niet wenst kunt u sshd_config handmatig aanpassen en de waarde op 'no' zetten.

source: It is strongly recommended that you let me generate a new configuration file for you.
fr: Il est fortement recommandé de créer un nouveau fichier de configuration.

source: Allow SSH protocol 2 only
fr: Faut-il autoriser uniquement la version 2 du protocole SSH ?

source: This version of OpenSSH supports version 2 of the ssh protocol, which is much more secure. Disabling ssh 1 is encouraged, however this will slow things down on low end machines and might prevent older clients from connecting (the ssh client shipped with "potato" is affected).
fr: Cette version d'OpenSSH gère la version 2 du protocole SSH, qui est bien plus sûre. Désactiver la version 1 est recommandé, cependant cela peut ralentir les machines peu puissantes et pourrait empêcher ceux qui utilisent de vieilles versions de la partie cliente de se connecter (le client ssh de la distribution Debian « Potato » en fait partie).

source: Also please note that keys used for protocol 1 are different so you will not be able to use them if you only allow protocol 2 connections.
fr: De plus, les clés utilisées par la version 1 du protocole sont différentes et vous ne pourrez pas les utiliser si vous n'autorisez que les connexions utilisant la version 2 du protocole.

source: If you later change your mind about this setting, README.Debian has instructions on what to do to your sshd_config file.
fr: Si vous changez d'avis ultérieurement et décidez de modifier ce réglage, les instructions fournies dans le fichier README.Debian vous indiquent comment modifier le fichier sshd_config.

source: ssh2 keys merged in configuration files
fr: Clés pour ssh2 fusionnées dans les fichiers de configuration

source: As of version 3 OpenSSH no longer uses separate files for ssh1 and ssh2 keys. This means the authorized_keys2 and known_hosts2 files are no longer needed. They will still be read in order to maintain backwards compatibility
fr: OpenSSH, depuis sa version 3, n'utilise plus de fichiers distincts pour les clés SSH1 et SSH2. Cela signifie que les fichiers authorized_keys2 et known_hosts2 ne sont plus utiles. Ils seront néanmoins lus afin de préserver la compatibilité descendante.

source: Do you want to continue (and risk killing active ssh sessions)?
cs: Chcete pokraèovat (a riskovat ukonèení aktivních ssh spojení)?
da: Vil du fortsætte (og risikere at afbryde aktive ssh-forbindelser)?
fr: Voulez-vous continuer (et risquer de rompre les sessions SSH actives) ?
nl: Wilt u verder gaan (waarbij u mogelijk actieve ssh sessies afschiet)?

source: The version of /etc/init.d/ssh that you have installed, is likely to kill all running sshd instances. If you are doing this upgrade via an ssh session, that would be a Bad Thing(tm).
cs: Stávající verze /etc/init.d/ssh pravdìpadobnì pozabíjí v¹echny bì¾ící instance sshd. Pokud tuto aktualizaci provádíte pøes ssh, byla by to ©patná Vìc(tm).
da: Den udgave af /etc/init.d/ssh, du har installeret, vil sandsynligvis afbryde alle sshd-dæmoner. Det vil være en rigtigt dårlig idé, hvis du er ved at opgradere via en ssh-forbindelse.
fr: La version de /etc/init.d/ssh que vous venez d'installer va vraisemblablement interrompre toutes les instances de sshd en cours. Si vous êtes en train de faire cette mise à niveau à l'aide de SSH, ce serait regrettable.
nl: De /etc/init.d/ssh versie die u geïnstalleerd hebt schiet waarschijnlijk alle lopende sshd-instanties af. Dit is Niet Goed wanneer u deze opwaardering via een ssh-sessie doet.

source: You can fix this by adding "--pidfile /var/run/sshd.pid" to the start-stop-daemon line in the stop section of the file.
cs: Mù¾ete to spravit pøidáním "--pidfile /var/run/sshd.pid" do sekce stop na øádek se start-stop-daemon.
da: Du kan afhjælpe dette ved at tilføje "--pidfile /var/run/sshd.pid" til 'start-stop-daemon'-linjen i stop-afsnittet af filen.
fr: Vous pouvez corriger cela en ajoutant dans /etc/init.d/ssh « --pidfile /var/run/sshd.pid » à la ligne « start-stop-daemon » dans la section « stop » du fichier.
nl: U kunt dit repareren door "--pidfile /var/run/sshd.pid" toe te voegen aan de start-stop-daemon regel in de stop-sectie van het bestand.

source: NOTE: Forwarding of X11 and Authorization disabled by default.
fr: Suivi de session X11 et d'agent d'autorisation désactivés par défaut.

source: For security reasons, the Debian version of ssh has ForwardX11 and ForwardAgent set to ``off'' by default.
fr: Pour des raisons de sécurité, la version Debian de ssh positionne les options ForwardX11 et ForwardAgent à « Off » par défaut.

source: You can enable it for servers you trust, either in one of the configuration files, or with the -X command line option.
fr: Vous pouvez activer ces options pour les serveurs en qui vous avez confiance, soit dans un des fichiers de configuration, soit avec l'option -X de la ligne de commande.

source: More details can be found in /usr/share/doc/ssh/README.Debian
fr: Vous trouverez plus d'informations dans /usr/share/doc/ssh/README.Debian.

source: Warning: rsh-server is installed --- probably not a good idea
cs: Varování: je nainstalován rsh-server --- to není dobrý nápad
da: Advarsel: rsh-serveren er installeret --- sikkert ikke en god idé
fr: Rsh-server installé : paquet déconseillé
nl: Waarschuwing: rsh-server is geïnstalleerd -- dit is waarschijnlijk geen goed idee

source: having rsh-server installed undermines the security that you were probably wanting to obtain by installing ssh. I'd advise you to remove that package.
cs: nainstalováním rsh-server si bouráte bezpeènost, kterou jste pravdìpodobnì chtìli dosáhnout instalací ssh. Doporuèujeme tento balík odstranit.
da: Den sikkerhed, du nok ønskede at opnå ved at installere ssh undermineres ved, at du har rsh-server installeret. Jeg vil råde dig til at fjerne pakken rsh-server.
fr: Avoir un serveur rsh installé affaiblit la sécurité que vous vouliez probablement obtenir en installant SSH. Il est conseillé de supprimer ce paquet.
nl: rsh-server geïnstalleerd hebben ondermijnt de beveiliging die u, waarschijnlijk, net probeerde te verkrijgen door ssh te installeren. We raden u aan om dat pakket te verwijderen.

source: Warning: telnetd is installed --- probably not a good idea
cs: Varování: je nainstalován telnetd --- to není dobrý nápad
da: Advarsel: telnetd er installeret --- sikkert ikke en god idé
fr: Telnetd installé : paquet déconseillé
nl: Waarschuwing: telnetd is geïnstalleerd -- dit is waarschijnlijk geen goed idee

source: I'd advise you to either remove the telnetd package (if you don't actually need to offer telnet access) or install telnetd-ssl so that there is at least some chance that telnet sessions will not be sending unencrypted login/password and session information over the network.
cs: Doporuèujeme buï odstranit balík telnetd (pokud telnet pøístup nepotøebujete), nebo nainstalovat telnetd-ssl, kde je alespoò nìjaká ¹ance, ¾e spojení nebudou po síti zasílat neza¹ifrovaná jména/hesla/informace.
da: Jeg vil råde dig til enten at fjerne pakken telnetd (hvis du i virkeligheden ikke har brug for at tilbyde telnet-adgang) eller installere telnetd-ssl, så der i det mindste er en mulighed for, at telnet-sessioner ikke sender adgangskoder og sessions-oplysninger ukrypteret over netværket.
fr: Vous devriez soit enlever le paquet telnetd (si ce service n'est pas nécessaire), soit le remplacer par le paquet telnetd-ssl pour qu'il y ait au moins une chance que les sessions telnet soient chiffrées et que les mots de passe et noms d'utilisateurs ne passent pas en clair sur le réseau.
nl: Ik raad u aan om of het telnetd-pakket te verwijderen (indien u geen telnettoegang hoeft aan te bieden), of telnetd-ssl te installeren zodat er enige kans is dat telnetsessies geen onversleutelde gebruikersnaam/wachtwoord en sessie informatie over het netwerk versturen.

source: Warning: you must create a new host key
cs: Varování: musíte vytvoøit nový serverový klíè
da: Advarsel: du skal oprette en ny værtsnøgle
fr: Nouvelle clé d'hôte nécessaire
nl: Waarschuwing: u dient een nieuwe computersleutel aan te maken

source: There is an old /etc/ssh/ssh_host_key, which is IDEA encrypted. OpenSSH can not handle this host key file, and I can't find the ssh-keygen utility from the old (non-free) SSH installation.
fr: Un ancien fichier /etc/ssh/ssh_host_key, chiffré avec IDEA, est actuellement utilisé. OpenSSH ne peut utiliser ce fichier de clé, et l'utilitaire ssh-keygen de l'installation précédente (non libre) de SSH n'a pas été trouvé.

source: You will need to generate a new host key.
cs: Musíte vygenerovat nový serverový klíè
da: Du skal oprette en ny værtsnøgle.
fr: Vous devez générer une nouvelle clé d'hôte.
nl: Het zal nodig zijn om een nieuwe computersleutel te genereren

source: Do you want /usr/lib/ssh-keysign to be installed SUID root?
fr: Faut-il installer /usr/lib/ssh-keysign avec le bit SETUID activé ?

source: You have the option of installing the ssh-keysign helper with the SUID bit set.
fr: Vous pouvez installer ssh-keysign avec le bit SETUID activé.

source: If you make ssh-keysign SUID, you will be able to use SSH's Protocol 2 host-based authentication.
fr: Si vous choisissez cette option, vous permettrez l'authentification basée sur les hôtes, disponible dans la version 2 du protocole SSH.

source: If in doubt, I suggest you install it with SUID. If it causes problems you can change your mind later by running: dpkg-reconfigure ssh
fr: Dans le doute, vous devriez l'installer avec le bit SETUID activé. Si cela vous pose des problèmes, vous pourrez revenir sur votre décision avec « dpkg-reconfigure ssh ».

source: Do you want to run the sshd server?
fr: Voulez-vous utiliser le serveur sshd ?

source: This package contains both the ssh client, and the sshd server.
fr: Ce paquet contient à la fois le client ssh et le serveur sshd.

source: Normally the sshd Secure Shell Server will be run to allow remote logins via ssh.
fr: Habituellement, le serveur sshd est lancé pour permettre les connexions distantes via SSH.

source: If you are only interested in using the ssh client for outbound connections on this machine, and don't want to log into it at all using ssh, then you can disable sshd here.
fr: Si vous désirez seulement utiliser le client ssh pour des connexions vers l'extérieur, ou si vous ne voulez pas vous connecter sur cette machine via SSH, vous pouvez désactiver sshd maintenant.

source: Environment options on keys have been deprecated
fr: Les options d'environnement sur les clés sont déconseillées

source: This version of OpenSSH disables the environment option for public keys by default, in order to avoid certain attacks (for example, LD_PRELOAD). If you are using this option in an authorized_keys file, beware that the keys in question will no longer work until the option is removed.
fr: Dans cette version d'OpenSSH, l'option d'environnement est, par défaut, désactivée pour les clés publiques. Cela est destiné à la prévention de certaines attaques (par exemple, LD_PRELOAD). Si vous utilisez cette option dans un fichier « authorized_keys », sachez que les clés concernées ne fonctionneront plus tant que l'option ne sera pas retirée.

source: To re-enable this option, set "PermitUserEnvironment yes" in /etc/ssh/sshd_config after the upgrade is complete, taking note of the warning in the sshd_config(5) manual page.
fr: Pour la réactiver, veuillez indiquer « PermitUserEnvironment yes » dans /etc/ssh/sshd_config lorsque la mise à niveau est terminée. Veuillez tenir compte de l'avertissement donné dans la page de manuel sshd_config(5).

source: Disable challenge-response authentication?
cs: Zakázat autentizaci challenge-response?
da: Slå udfordrings-svar godkendelse fra?
fr: Faut-il désactiver l'authentification par défi-réponse ?
nl: Challenge-response-authenticatie deactiveren?

source: Password authentication appears to be disabled in your current OpenSSH server configuration. In order to prevent users from logging in using passwords (perhaps using only public key authentication instead) with recent versions of OpenSSH, you must disable challenge-response authentication, or else ensure that your PAM configuration does not allow Unix password file authentication.
cs: Zdá se, ¾e autentizace pomocí hesel je ve va¹í stávající konfiguraci OpenSSH serveru zakázána. Abyste zabránili u¾ivatelùm v pøihlá¹ení pouze pomocí hesla, musíte v posledních verzích OpenSSH zakázat autentizaci challenge-response, nebo jinak zajistit, aby PAM nepovolilo autentizaci vùèi unixovému souboru hesel.
da: Adgangskodegodkendelse ser ud til at være deaktiveret i din nuværende OpenSSH server opsætning. For at forhindre brugere i at logge ind med adgangskoder (f.eks. kun offentlig nøgle godkendelse) med nyere versioner af OpenSSH, skal du deaktivere udfordrings-svar godkendelse, eller sikre at din PAM opsætning ikke itllader Unix adgangskodefil godkendelse.
fr: L'authentification par mots de passe semble être désactivée dans la configuration actuelle de votre serveur OpenSSH. Afin de vraiment empêcher les utilisateurs de se connecter avec un mot de passe (par exemple en n'autorisant que l'authentification par clé publique), vous devez aussi désactiver l'authentification par défi-réponse dans les versions récentes d'OpenSSH, ou alors vous assurer que votre configuration de PAM n'autorise pas l'authentification avec le fichier de mots de passe.
nl: Zo te zien is wachtwoord-authenticatie momenteel gedeactiveert in uw OpenSSH-serverconfiguratie. Om te voorkomen dat gebruikers met recente versies van OpenSSH inloggen met behulp van wachtwoorden (mogelijk door in plaats daarvan enkel publieke-sleutel authenticatie te gebruiken) dient challenge-response-authenticatie gedeactiveerd te woren. Zoniet dient u ervoor te zorgen dat uw PAM-configuratie geen Unix 'password'-bestand-authenticatie toe laat.

source: If you disable challenge-response authentication, then users will not be able to log in using passwords. If you leave it enabled (the default answer), then the 'PasswordAuthentication no' option will have no useful effect unless you also adjust your PAM configuration in /etc/pam.d/ssh.
cs: Zaká¾ete-li autentizaci challenge-response, u¾ivatelé se nebudou moci pøihlásit pomocí hesel. Necháte-li ji povolenu (pøednastavená odpovìï), pak nebude mít volba 'PasswordAuthentication no' ¾ádný efekt, pokud ov¹em neupravíte nastavení PAM v /etc/pam.d/ssh.
da: Hvis du deaktiverer udfordrings-svar godkendelse, vil brugere ikke være i stand til at logge ind med adgangskoder. Hvis du lader det slået til (standard svaret), så vil 'PasswordAuthentication no' indstillingen ikke have nogen effekt, medmindre du også redigerer din PAM opsætning i /etc/pam.d/ssh.
fr: Si vous désactivez l'authentification par défi-réponse, alors les utilisateurs ne pourront pas se connecter en entrant un mot de passe. Si vous la laissez active (ce qui est le défaut), alors l'option « PasswordAuthentication no » n'aura d'effet que si vous ajustez aussi la configuration de PAM dans /etc/pam.d/ssh.
nl: Wanneer u challenge-response-authenticatie deactiveerd kunnen gebruikers niet meer inloggen met behulp van wachtwoorden. Als u het geactiveerd laat (de standaarwaarde) zal de 'PasswordAuthentication no' optie geen (nuttig) effect hebben tenzij u ook de PAM-configuratie aanpast in /etc/pam.d/ssh.
